app/views/items/my_items.html.erb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
<h2><%= current_user.username.capitalize %>'s Items</h2>
<% current_user.items.each do |item| %>