app/controllers/conversations_controller.rb

  def create
    recipients = User.find(conversation_params[:recipients])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]