app/controllers/items_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @item = Item.new
    @categories = Category.all

INSERT INTO "items" ("title", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Ball"], ["description", "Ball"], ["price", 28.0], ["user_id", 1], ["created_at", "2015-11-23 23:20:05.741497"], ["updated_at", "2015-11-23 23:20:05.741497"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save