app/controllers/storefront_controller.rb

SELECT "items".* FROM "items"
---
  def all_items
    @items = Item.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items"
---
  def items_by_category
    @category = Category.find(params[:cat_id])
    @items = Item.all